title: Suspicious File Open in Downloads Directory (Splunk)
id: 01e3d943-0003-45de-8e9e-123456789003
description: Detects opening of suspicious file types in Downloads folder from Sysmon logs in Splunk.
status: experimental
author: WongShihNing
date: 2025/07/01
logsource:
  product: windows
  service: sysmon
  category: file_access
detection:
  selection:
    EventCode:
      - 11
      - 1116
    path|contains:
      - "C:\\Users\\Public\\Downloads"
    path|endswith:
      - ".exe"
      - ".vbs"
      - ".lnk"
  condition: selection
level: medium
tags:
  - attack.initial_access
