title: Suspicious File Open in Downloads Directory (Azure KQL)
id: 01e3d943-0002-45de-8e9e-123456789002
description: Detects opening of suspicious file types in Downloads folder via Azure SecurityEvent table.
status: experimental
author: WongShihNing
date: 2025/07/01
logsource:
  product: windows
  service: security
  category: file_access
detection:
  selection:
    EventID:
      - 11
      - 1116
    TargetFilename|contains:
      - "C:\\Users\\Public\\Downloads"
    TargetFilename|endswith:
      - ".exe"
      - ".vbs"
      - ".lnk"
  condition: selection
level: medium
tags:
  - attack.initial_access